app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'gudang.a@example.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');


        log_message('debug', 'Input email: ' . $email . ', password: ' . $password);

        $user = $model->where('email', $email)->first();