app/Controllers/Permintaan.php

SELECT `permintaan`.*, `users`.`name` as `pemohon_name`
FROM `permintaan`
JOIN `users` ON `users`.`id` = `permintaan`.`pemohon_id`
WHERE `pemohon_id` = '6'
---
    public function index()
    {
        $role = session()->get('role');
        if ($role === 'dapur') {
            $data['permintaan'] = $this->model->where('pemohon_id', session()->get('user_id'))
                                             ->select('permintaan.*, users.name as pemohon_name')
                                             ->join('users', 'users.id = permintaan.pemohon_id')
                                             ->findAll();

INSERT INTO `permintaan` (`pemohon_id`, `tgl_masak`, `menu_makan`, `jumlah_porsi`, `status`, `created_at`, `updated_at`) VALUES ('6', '2025-12-20', 'Nasi Goreng Seafood', '50', 'menunggu', '2025-10-04 12:03:25', '2025-10-04 12:03:25')
---
    public function store()
    {
        if (session()->get('role') !== 'dapur') {
            return redirect()->to('/dashboard/dapur')->with('error', 'Akses ditolak');
        }
        $post = $this->request->getPost();
        $bahanIds = $this->request->getPost('bahan_id');
        $jumlahDiminta = $this->request->getPost('jumlah_diminta');

        $today = date('Y-m-d');
        if (strtotime($post['tgl_masak']) < strtotime($today)) {
            return redirect()->back()->with('error', 'Tanggal masak tidak boleh sebelum hari ini');
        }
        if (empty($bahanIds) || empty($jumlahDiminta)) {
            return redirect()->back()->with('error', 'Pilih setidaknya satu bahan dan jumlah');
        }

        $permintaanData = [
            'pemohon_id' => session()->get('user_id'),
            'tgl_masak' => $post['tgl_masak'],
            'menu_makan' => $post['menu_makan'],
            'jumlah_porsi' => $post['jumlah_porsi'],
            'status' => 'menunggu'
        ];
        $permintaanId = $this->model->insert($permintaanData, true);

INSERT INTO `permintaan_detail` (`bahan_id`, `jumlah_diminta`, `permintaan_id`)
VALUES ('14','50',18)
---
                ];
            }
        }
        $this->db->table('permintaan_detail')->insertBatch($detailData);

UPDATE `permintaan` SET `status` = 'ditolak', `updated_at` = '2025-10-02 03:50:12'
WHERE `permintaan`.`id` IN ('15')
---
    public function reject($id)
    {
        if (session()->get('role') !== 'gudang') {
            return redirect()->to('/permintaan')->with('error', 'Akses ditolak');
        }
        $permintaan = $this->model->find($id);
        if (!$permintaan || $permintaan['status'] !== 'menunggu') {
            return redirect()->to('/permintaan')->with('error', 'Permintaan tidak valid atau sudah diproses');
        }

        $this->model->update($id, ['status' => 'ditolak']);