app/Models/BahanBakuModel.php

    public function getWithStatus()
    {
        $bahan = $this->findAll();
        $today = date('Y-m-d');

        foreach ($bahan as &$item) {
            if ($item['jumlah'] == 0) {
                $item['status'] = 'habis';
            } elseif (strtotime($today) >= strtotime($item['tanggal_kadaluarsa'])) {
                $item['status'] = 'kadaluarsa';
            } elseif ((strtotime($item['tanggal_kadaluarsa']) - strtotime($today)) / 86400 <= 3 && $item['jumlah'] > 0) {
                $item['status'] = 'segera_kadaluarsa';
            } else {
                $item['status'] = 'tersedia';
            }

            $this->update($item['id'], ['status' => $item['status']]);
---
SELECT *
FROM `bahan_baku`
UPDATE `bahan_baku` SET `status` = 'tersedia', `updated_at` = '2025-10-04 11:58:42'
WHERE `bahan_baku`.`id` IN ('1')