app/Models/PermintaanModel.php

SELECT `p`.*, `p`.`alasan_ditolak`, `users`.`name` as `pemohon_name`, `pd`.`jumlah_diminta`, `bb`.`nama` as `bahan_nama`
FROM `permintaan` `p`
JOIN `users` ON `users`.`id` = `p`.`pemohon_id`
JOIN `permintaan_detail` `pd` ON `pd`.`permintaan_id` = `p`.`id`
JOIN `bahan_baku` `bb` ON `bb`.`id` = `pd`.`bahan_id`
ORDER BY `p`.`id` DESC
---
    public function getPermintaanWithDetails()
    {
        $builder = $this->db->table('permintaan p');
        $builder->select('p.*, p.alasan_ditolak, users.name as pemohon_name, pd.jumlah_diminta, bb.nama as bahan_nama')
                ->join('users', 'users.id = p.pemohon_id')
                ->join('permintaan_detail pd', 'pd.permintaan_id = p.id')
                ->join('bahan_baku bb', 'bb.id = pd.bahan_id')
                ->orderBy('p.id', 'DESC');
        return $builder->get()->getResultArray();

SELECT *
FROM `bahan_baku`
WHERE `status` != 'habis'
---
    public function getBahanTersedia()
    {
        $builder = $this->db->table('bahan_baku');
        $builder->where('status', 'tersedia');
        return $builder->get()->getResultArray();